<center><h1><b><font size="6">Pandas Series: .sort_values()</font></b></h1></center>

In [2]:
import pandas as pd

In [3]:
numbers = pd.Series([15, 1000, 23, 45, 444])
numbers

0      15
1    1000
2      23
3      45
4     444
dtype: int64

In [4]:
numbers.sort_values()

0      15
2      23
3      45
4     444
1    1000
dtype: int64

In [5]:
numbers.sort_values(ascending=True)

0      15
2      23
3      45
4     444
1    1000
dtype: int64

In [6]:
numbers.sort_values(ascending=False)

1    1000
4     444
3      45
2      23
0      15
dtype: int64

#### Load the data

In [8]:
data = pd.read_csv('./data/Location.csv')
location_data = data.copy()
location_data.head()

      Location
0   Location 3
1   Location 6
2   Location 8
3  Location 26
4  Location 34

In [12]:
location_data.sort_values(by='Location')

        Location
637   Location 1
884   Location 1
465   Location 1
716  Location 10
623  Location 10
..           ...
482  Location 97
128  Location 97
669  Location 97
757  Location 98
372  Location 99

[1043 rows x 1 columns]

In [13]:
location_data.sort_values(by='Location', ascending=True)

        Location
637   Location 1
884   Location 1
465   Location 1
716  Location 10
623  Location 10
..           ...
482  Location 97
128  Location 97
669  Location 97
757  Location 98
372  Location 99

[1043 rows x 1 columns]

In [14]:
location_data.sort_values(by='Location', ascending=False)

        Location
372  Location 99
757  Location 98
128  Location 97
482  Location 97
271  Location 97
..           ...
202  Location 10
298  Location 10
637   Location 1
884   Location 1
465   Location 1

[1043 rows x 1 columns]